In [1]:
import pandas as pd
import numpy as np

In [2]:
from pydataset import data

In [3]:
# data('mpg', show_doc=True) # view the documentation for the dataset
mpg = data('mpg', show_doc=True) # load the dataset and store it in a variable

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

Copy the code from the lesson to create a dataframe full of student grades.

In [4]:
np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

students_df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})
students_df.head()

    name  math  english  reading
0  Sally    62       85       80
1   Jane    88       79       67
2  Suzie    94       74       95
3  Billy    98       96       88
4    Ada    77       92       98

Create a column named passing_english that indicates whether each student has a passing grade in english.

In [5]:
students_df['passing_english'] = students_df['english'] > 70
print(students_df)

       name  math  english  reading  passing_english
0     Sally    62       85       80             True
1      Jane    88       79       67             True
2     Suzie    94       74       95             True
3     Billy    98       96       88             True
4       Ada    77       92       98             True
5      John    79       76       93             True
6    Thomas    82       64       81            False
7     Marie    93       63       90            False
8    Albert    92       62       87            False
9   Richard    69       80       94             True
10    Isaac    92       99       93             True
11     Alan    92       62       72            False

Sort the english grades by the passing_english column. How are duplicates handled?

In [6]:
students_df.value_counts('passing_english')

passing_english
True     8
False    4
dtype: int64

Sort the english grades first by passing_english and then by student name. All the students that are failing english should be first, and within the students that are failing english they should be ordered alphabetically. The same should be true for the students passing english. (Hint: you can pass a list to the .sort_values method)

In [7]:
students_df.sort_values(['passing_english', 'name'])

       name  math  english  reading  passing_english
11     Alan    92       62       72            False
8    Albert    92       62       87            False
7     Marie    93       63       90            False
6    Thomas    82       64       81            False
4       Ada    77       92       98             True
3     Billy    98       96       88             True
10    Isaac    92       99       93             True
1      Jane    88       79       67             True
5      John    79       76       93             True
9   Richard    69       80       94             True
0     Sally    62       85       80             True
2     Suzie    94       74       95             True

Sort the english grades first by passing_english, and then by the actual english grade, similar to how we did in the last step.

In [8]:
students_df.value_counts('passing_english')

passing_english
True     8
False    4
dtype: int64

Calculate each students overall grade and add it as a column on the dataframe. The overall grade is the average of the math, english, and reading grades.

In [9]:
students_df['overall_grade']= students_df[['english','math','reading']].mean(axis=1)

Load the mpg dataset. Read the documentation for the dataset and use it for the following questions:

In [10]:
mpg_df = data('mpg')
print(mpg_df)

    manufacturer   model  displ  year  cyl       trans drv  cty  hwy fl  \
1           audi      a4    1.8  1999    4    auto(l5)   f   18   29  p
2           audi      a4    1.8  1999    4  manual(m5)   f   21   29  p
3           audi      a4    2.0  2008    4  manual(m6)   f   20   31  p
4           audi      a4    2.0  2008    4    auto(av)   f   21   30  p
5           audi      a4    2.8  1999    6    auto(l5)   f   16   26  p
..           ...     ...    ...   ...  ...         ...  ..  ...  ... ..
230   volkswagen  passat    2.0  2008    4    auto(s6)   f   19   28  p
231   volkswagen  passat    2.0  2008    4  manual(m6)   f   21   29  p
232   volkswagen  passat    2.8  1999    6    auto(l5)   f   16   26  p
233   volkswagen  passat    2.8  1999    6  manual(m5)   f   18   26  p
234   volkswagen  passat    3.6  2008    6    auto(s6)   f   17   26  p

       class
1    compact
2    compact
3    compact
4    compact
5    compact
..       ...
230  midsize
231  midsize
232  midsize
233  midsize
234  midsize

[234 rows x 11 columns]

How many rows and columns are there?

In [11]:
mpg_df.shape

(234, 11)

What are the data types of each column?

In [12]:
mpg_df.dtypes

manufacturer     object
model            object
displ           float64
year              int64
cyl               int64
trans            object
drv              object
cty               int64
hwy               int64
fl               object
class            object
dtype: object

Summarize the dataframe with .info and .describe

In [13]:
mpg_df.describe(), mpg_df.info

(            displ         year         cyl         cty         hwy
 count  234.000000   234.000000  234.000000  234.000000  234.000000
 mean     3.471795  2003.500000    5.888889   16.858974   23.440171
 std      1.291959     4.509646    1.611534    4.255946    5.954643
 min      1.600000  1999.000000    4.000000    9.000000   12.000000
 25%      2.400000  1999.000000    4.000000   14.000000   18.000000
 50%      3.300000  2003.500000    6.000000   17.000000   24.000000
 75%      4.600000  2008.000000    8.000000   19.000000   27.000000
 max      7.000000  2008.000000    8.000000   35.000000   44.000000,
 <bound method DataFrame.info of     manufacturer   model  displ  year  cyl       trans drv  cty  hwy fl  \
 1           audi      a4    1.8  1999    4    auto(l5)   f   18   29  p
 2           audi      a4    1.8  1999    4  manual(m5)   f   21   29  p
 3           audi      a4    2.0  2008    4  manual(m6)   f   20   31  p
 4           audi      a4    2.0  2008    4    auto(av)   f   21   30  p
 5           audi      a4    2.8  1999    6    auto(l5)   f   16   26  p
 ..           ...     ...    ...   ...  ...         ...  ..  ...  ... ..
 230   volkswagen  passat    2.0  2008    4    auto(s6)   f   19   28  p
 231   volkswagen  passat    2.0  2008    4  manual(m6)   f   21   29  p
 232   volkswagen  passat    2.8  1999    6    auto(l5)   f   16   26  p
 233   volkswagen  passat    2.8  1999    6  manual(m5)   f   18   26  p
 234   volkswagen  passat    3.6  2008    6    auto(s6)   f   17   26  p

        class
 1    compact
 2    compact
 3    compact
 4    compact
 5    compact
 ..       ...
 230  midsize
 231  midsize
 232  midsize
 233  midsize
 234  midsize

 [234 rows x 11 columns]>)

Rename the cty column to city.

In [14]:
mpg_df = mpg_df.rename(columns={'cty':'city'})

Rename the hwy column to highway.

In [15]:
mpg_df = mpg_df.rename(columns={'hwy':'highway'})
print(mpg_df)

    manufacturer   model  displ  year  cyl       trans drv  city  highway fl  \
1           audi      a4    1.8  1999    4    auto(l5)   f    18       29  p
2           audi      a4    1.8  1999    4  manual(m5)   f    21       29  p
3           audi      a4    2.0  2008    4  manual(m6)   f    20       31  p
4           audi      a4    2.0  2008    4    auto(av)   f    21       30  p
5           audi      a4    2.8  1999    6    auto(l5)   f    16       26  p
..           ...     ...    ...   ...  ...         ...  ..   ...      ... ..
230   volkswagen  passat    2.0  2008    4    auto(s6)   f    19       28  p
231   volkswagen  passat    2.0  2008    4  manual(m6)   f    21       29  p
232   volkswagen  passat    2.8  1999    6    auto(l5)   f    16       26  p
233   volkswagen  passat    2.8  1999    6  manual(m5)   f    18       26  p
234   volkswagen  passat    3.6  2008    6    auto(s6)   f    17       26  p

       class
1    compact
2    compact
3    compact
4    compact
5    compact
..       ...
230  midsize
231  midsize
232  midsize
233  midsize
234  midsize

[234 rows x 11 columns]

Do any cars have better city mileage than highway mileage?

In [16]:
(mpg_df['city'] > mpg_df['highway']).any()

False

Create a column named mileage_difference this column should contain the difference between highway and city mileage for each car.

In [17]:
mpg_df['mileage_difference'] = mpg_df['highway'] - mpg_df['city']
mpg_df.head()

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

Which car (or cars) has the highest mileage difference?

In [28]:
mpg_df = data('mpg')
dodge_df = mpg_df[mpg_df['manufacturer'] == 'dodge']
max_mileage_dodge = dodge_df[dodge_df['average_mileage'] == dodge_df['average_mileage'].max()]

KeyError: 'average_mileage'

Which compact class car has the lowest highway mileage? The best?

In [20]:
df_compact = mpg_df[mpg_df['class'] == 'compact']
df_compact[df_compact['highway'] == df_compact['highway'].min()]

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
220,volkswagen,jetta,2.8,1999,6,auto(l4),f,16,23,r,compact,7

In [21]:
df_compact[df_compact['highway'] == df_compact['highway'].max()]

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
213,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,11

Create a column named average_mileage that is the mean of the city and highway mileage.

In [22]:
mpg_df['average_mileage'] = (mpg_df['city'] + mpg_df['highway']) / 2
mpg_df.head()

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0

Which dodge car has the best average mileage? The worst?

In [23]:
dodge_df = mpg_df[mpg_df['manufacturer'] == 'dodge']
dodge_df[dodge_df['average_mileage'] == dodge_df['average_mileage'].max()]

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference,average_mileage
38,dodge,caravan 2wd,2.4,1999,4,auto(l3),f,18,24,r,minivan,6,21.0

In [24]:
dodge_df[dodge_df['average_mileage'] == dodge_df['average_mileage'].min()]

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference,average_mileage
55,dodge,dakota pickup 4wd,4.7,2008,8,auto(l5),4,9,12,e,pickup,3,10.5
60,dodge,durango 4wd,4.7,2008,8,auto(l5),4,9,12,e,suv,3,10.5
66,dodge,ram 1500 pickup 4wd,4.7,2008,8,auto(l5),4,9,12,e,pickup,3,10.5
70,dodge,ram 1500 pickup 4wd,4.7,2008,8,manual(m6),4,9,12,e,pickup,3,10.5

Load the Mammals dataset. Read the documentation for it, and use the data to answer these questions:

In [25]:
data('Mammals', show_doc = True)

Mammals

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Garland(1983) Data on Running Speed of Mammals

### Description

Observations on the maximal running speed of mammal species and their body
mass.

### Usage

    data(Mammals)

### Format

A data frame with 107 observations on the following 4 variables.

weight

Body mass in Kg for "typical adult sizes"

speed

Maximal running speed (fastest sprint velocity on record)

hoppers

logical variable indicating animals that ambulate by hopping, e.g. kangaroos

specials

logical variable indicating special animals with "lifestyles in which speed
does not figure as an important factor": Hippopotamus, raccoon (Procyon),
badger (Meles), coati (Nasua), skunk (Mephitis), man (Homo), porcupine
(Erithizon), oppossum (didelphis), and sloth (Bradypus)

### Details

Used by Chappell (1989) and Koenker, Ng and Portnoy (1994) to illustrate the
fitting of piecewise linear curves.

### Source

Garland, T. (1983) The relation between maximal running speed and body mass in
terrestrial mammals, _J. Zoology_, 199, 1557-1570.

### References

Koenker, R., P. Ng and S. Portnoy, (1994) Quantile Smoothing Splines
_Biometrika_, 81, 673-680.

Chappell, R. (1989) Fitting Bent Lines to Data, with Applications ot
Allometry, _J. Theo. Biology_, 138, 235-256.

### See Also

`rqss`

### Examples

    data(Mammals)
    attach(Mammals)
    x <- log(weight)
    y <- log(speed)
    plot(x,y, xlab="Weight in log(Kg)", ylab="Speed in log(Km/hour)",type="n")
    points(x[hoppers],y[hoppers],pch = "h", col="red")
    points(x[specials],y[specials],pch = "s", col="blue")
    others <- (!hoppers & !specials)
    points(x[others],y[others], col="black",cex = .75)
    fit <- rqss(y ~ qss(x, lambda = 1),tau = .9)
    plot(fit)

How many rows and columns are there?

In [26]:
mammals_df = data('Mammals')
print(mammals_df.shape)

(107, 4)

What are the data types?

In [27]:
mammals_df.dtypes

weight      float64
speed       float64
hoppers        bool
specials       bool
dtype: object

Summarize the dataframe with .info and .describe

In [ ]:
mammals_df.info()

In [ ]:
mammals_df.describe()

What is the the weight of the fastest animal?

In [ ]:
mammals_df = data('Mammals')
fastest_speed = mammals_df['speed'].max()
fastest_animal_weight = mammals_df.loc[mammals_df['speed'] == fastest_speed, 'weight'].values[0]
print(fastest_animal_weight)

What is the overal percentage of specials?

In [ ]:
mammals_df = data('Mammals')
total_count = len(mammals_df)
specials_count = len(mammals_df[mammals_df['specials']])
percentage_specials = (specials_count / total_count) * 100
print(percentage_specials)

In [ ]:
#another way
mammals_df['specials'].value_counts(normalize=True)

How many animals are hoppers that are above the median speed? What percentage is this?

In [ ]:
above_avg_spd = mammals_df[mammals_df['speed'] > mammals_df['speed'].median()]
above_avg_spd[above_avg_spd['hoppers'] == True]

In [ ]:
above_avg_spd['hoppers'].value_counts(normalize = True)